# RulingsAreParallel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RuledFace..::..RulingsAreParallel Property
RuledFace Class See Also
---
Determines if the rulings of this ruled surface are parallel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool RulingsAreParallel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RulingsAreParallel As Boolean
	Get
```

Visual C++
---
```text
public:
property bool RulingsAreParallel {
	bool get ();
}
```

# See Also
RuledFace Class
Autodesk.Revit.DB Namespace